In [1]:
import pandas as pd

In [2]:
bio_data = {'성명':['이겨레','조약돌'],
            '나이':[25,19], '성별':['남','여'],
            '키':[185,163], '체중':[89,53]}
df = pd.DataFrame(bio_data)
df

    성명  나이 성별    키  체중
0  이겨레  25  남  185  89
1  조약돌  19  여  163  53

In [3]:
# 열 추가 (like Dict)
df['BMI'] = 0
df

    성명  나이 성별    키  체중  BMI
0  이겨레  25  남  185  89    0
1  조약돌  19  여  163  53    0

In [5]:
df['BMI'] = [18.6, 22.0] 
df

    성명  나이 성별    키  체중   BMI
0  이겨레  25  남  185  89  18.6
1  조약돌  19  여  163  53  22.0

In [8]:
# 행 추가
# 1. 모든 원소에 같은 데이터의 값을 추가하여 새로운 행 추가
df.loc[2] = 0
df

    성명  나이 성별    키  체중   BMI
0  이겨레  25  남  185  89  18.6
1  조약돌  19  여  163  53  22.0
2    0   0  0    0   0   0.0
3  강산에  27  남  177  63  20.9

In [9]:
# 2. 열의 개수만큼 데이터의 값을 각각 지정하여 새로운 행 추가
df.loc[3] = ['강산에',27,'남',177,63,20.9]
df

    성명  나이 성별    키  체중   BMI
0  이겨레  25  남  185  89  18.6
1  조약돌  19  여  163  53  22.0
2    0   0  0    0   0   0.0
3  강산에  27  남  177  63  20.9

In [10]:
# 3. 기존 행을 복사하여 새로운 행 추가
df.loc['홍길동'] = df.loc[3]
df

      성명  나이 성별    키  체중   BMI
0    이겨레  25  남  185  89  18.6
1    조약돌  19  여  163  53  22.0
2      0   0  0    0   0   0.0
3    강산에  27  남  177  63  20.9
홍길동  강산에  27  남  177  63  20.9